# CLI tools - essentials
brew "coreutils"
brew "findutils"
brew "moreutils"
brew "fontconfig"
brew "git"
brew "git-extras"
brew "python"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "zsh"
brew "gh"

# Version management
brew "mise"

# Modern CLI replacements
brew "bat"        # better cat
brew "eza"        # better ls
brew "fd"         # better find
brew "ripgrep"    # better grep
brew "fzf"        # fuzzy finder
brew "zoxide"     # smarter cd

# AI tools
brew "opencode"

# Casks - apps
cask "1password"
cask "alfred"
cask "bruno"
cask "claude"
cask "daisydisk"
cask "discord"
cask "github"
cask "iterm2"
cask "mounty"
cask "protonvpn"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"

# Fonts
cask "font-dejavu-sans-mono-nerd-font"
